import textwrap



HELLO_RESPONSES = {
    "привіт": lambda name: f"Привіт, {name}!",
    "привет": lambda name: f"Шо ти, {name} Москалюк?",
    "хай": lambda name: f"Хай, {name} :)",
    "здоров": lambda name: f"Здоровеньки були, {name}!"
}


help_text = textwrap.dedent("""\
    🛟 Допомога доступна!

    Ось що я вмію:
    🗨️ Напиши "Привіт", "Хай" або "Привет" — і я з тобою поговорю.
    ℹ️ Я відповідаю на прості повідомлення — спробуй щось написати!
    Регаую на тип повідомлення 

    📌 Команди:
    /start — почати розмову зі мною
    /help — побачити це меню
    /keyboard - відкрити меню-клавіатуру
    /myinfo - пидивитись інформацію про себе
    /update_username - оновити свій username (/update_username -> update_username @YourNewUserName)
    /delete_me - видалити інформацію про себе
                            

    Зв’язок з розробником: @твоє_ім’я_або_юзернейм

    🧠 Нові функції незабаром!
""")

about_text = textwrap.dedent("""\
    Привіт, мене звати Моц Бот
    Поки, що я можу тільки відповісти на декілька привітань
    але згодом...
""")